app/controllers/teams_controller.rb

SELECT * FROM "teams"
---
  def index
    @teams = Team.all

SELECT * FROM "teams" WHERE ("teams"."id" = 3)
---
  def show
    @team = Team.find(params[:id])